AdrianoRuseler/LAUNCHXL-F28379D/C2000Ware/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPCODR register
//
//*****************************************************************************
#define GPIO_GPCODR_GPIO64        0x1         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO65        0x2         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO66        0x4         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO67        0x8         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO68        0x10        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO69        0x20        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO70        0x40        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO71        0x80        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO72        0x100       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO73        0x200       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO74        0x400       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO75        0x800       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO76        0x1000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO77        0x2000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO78        0x4000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO79        0x8000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO80        0x10000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO81        0x20000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO82        0x40000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO83        0x80000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO84        0x100000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO85        0x200000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO86        0x400000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO87        0x800000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO88        0x1000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO89        0x2000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO90        0x4000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO91        0x8000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO92        0x10000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO93        0x20000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO94        0x40000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO95        0x80000000  // Outpout Open-Drain control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCGMUX1 register
//
//*****************************************************************************
#define GPIO_GPCGMUX1_GPIO64_S    0
#define GPIO_GPCGMUX1_GPIO64_M    0x3         // Defines pin-muxing selection
                                              // for GPIO64
#define GPIO_GPCGMUX1_GPIO65_S    2
#define GPIO_GPCGMUX1_GPIO65_M    0xC         // Defines pin-muxing selection
                                              // for GPIO65
#define GPIO_GPCGMUX1_GPIO66_S    4
#define GPIO_GPCGMUX1_GPIO66_M    0x30        // Defines pin-muxing selection
                                              // for GPIO66
#define GPIO_GPCGMUX1_GPIO67_S    6
#define GPIO_GPCGMUX1_GPIO67_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO67
#define GPIO_GPCGMUX1_GPIO68_S    8
#define GPIO_GPCGMUX1_GPIO68_M    0x300       // Defines pin-muxing selection
                                              // for GPIO68
#define GPIO_GPCGMUX1_GPIO69_S    10
#define GPIO_GPCGMUX1_GPIO69_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO69
#define GPIO_GPCGMUX1_GPIO70_S    12
#define GPIO_GPCGMUX1_GPIO70_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO70
#define GPIO_GPCGMUX1_GPIO71_S    14
#define GPIO_GPCGMUX1_GPIO71_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO71
#define GPIO_GPCGMUX1_GPIO72_S    16
#define GPIO_GPCGMUX1_GPIO72_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO72
#define GPIO_GPCGMUX1_GPIO73_S    18
#define GPIO_GPCGMUX1_GPIO73_M    0xC0000     // Defines pin-muxing selection
                                              // for GPIO73
#define GPIO_GPCGMUX1_GPIO74_S    20
#define GPIO_GPCGMUX1_GPIO74_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO74
#define GPIO_GPCGMUX1_GPIO75_S    22
#define GPIO_GPCGMUX1_GPIO75_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO75
#define GPIO_GPCGMUX1_GPIO76_S    24
#define GPIO_GPCGMUX1_GPIO76_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO76
#define GPIO_GPCGMUX1_GPIO77_S    26
#define GPIO_GPCGMUX1_GPIO77_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO77
#define GPIO_GPCGMUX1_GPIO78_S    28
#define GPIO_GPCGMUX1_GPIO78_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO78
#define GPIO_GPCGMUX1_GPIO79_S    30
#define GPIO_GPCGMUX1_GPIO79_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO79

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCGMUX2 register
//
//*****************************************************************************
#define GPIO_GPCGMUX2_GPIO80_S    0
#define GPIO_GPCGMUX2_GPIO80_M    0x3         // Defines pin-muxing selection
                                              // for GPIO80
#define GPIO_GPCGMUX2_GPIO81_S    2
#define GPIO_GPCGMUX2_GPIO81_M    0xC         // Defines pin-muxing selection
                                              // for GPIO81
#define GPIO_GPCGMUX2_GPIO82_S    4
#define GPIO_GPCGMUX2_GPIO82_M    0x30        // Defines pin-muxing selection
                                              // for GPIO82
#define GPIO_GPCGMUX2_GPIO83_S    6
#define GPIO_GPCGMUX2_GPIO83_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO83
#define GPIO_GPCGMUX2_GPIO84_S    8
#define GPIO_GPCGMUX2_GPIO84_M    0x300       // Defines pin-muxing selection
                                              // for GPIO84
#define GPIO_GPCGMUX2_GPIO85_S    10
#define GPIO_GPCGMUX2_GPIO85_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO85
#define GPIO_GPCGMUX2_GPIO86_S    12
#define GPIO_GPCGMUX2_GPIO86_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO86
#define GPIO_GPCGMUX2_GPIO87_S    14
#define GPIO_GPCGMUX2_GPIO87_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO87
#define GPIO_GPCGMUX2_GPIO88_S    16
#define GPIO_GPCGMUX2_GPIO88_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO88
#define GPIO_GPCGMUX2_GPIO89_S    18
#define GPIO_GPCGMUX2_GPIO89_M    0xC0000     // Defines pin-muxing selection
                                              // for GPIO89
#define GPIO_GPCGMUX2_GPIO90_S    20
#define GPIO_GPCGMUX2_GPIO90_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO90
#define GPIO_GPCGMUX2_GPIO91_S    22
#define GPIO_GPCGMUX2_GPIO91_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO91
#define GPIO_GPCGMUX2_GPIO92_S    24
#define GPIO_GPCGMUX2_GPIO92_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO92
#define GPIO_GPCGMUX2_GPIO93_S    26
#define GPIO_GPCGMUX2_GPIO93_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO93
#define GPIO_GPCGMUX2_GPIO94_S    28
#define GPIO_GPCGMUX2_GPIO94_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO94
#define GPIO_GPCGMUX2_GPIO95_S    30
#define GPIO_GPCGMUX2_GPIO95_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO95

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL1 register
//
//*****************************************************************************
#define GPIO_GPCCSEL1_GPIO64_S    0
#define GPIO_GPCCSEL1_GPIO64_M    0xF         // GPIO64 Master CPU Select
#define GPIO_GPCCSEL1_GPIO65_S    4
#define GPIO_GPCCSEL1_GPIO65_M    0xF0        // GPIO65 Master CPU Select
#define GPIO_GPCCSEL1_GPIO66_S    8
#define GPIO_GPCCSEL1_GPIO66_M    0xF00       // GPIO66 Master CPU Select
#define GPIO_GPCCSEL1_GPIO67_S    12
#define GPIO_GPCCSEL1_GPIO67_M    0xF000      // GPIO67 Master CPU Select
#define GPIO_GPCCSEL1_GPIO68_S    16
#define GPIO_GPCCSEL1_GPIO68_M    0xF0000     // GPIO68 Master CPU Select
#define GPIO_GPCCSEL1_GPIO69_S    20
#define GPIO_GPCCSEL1_GPIO69_M    0xF00000    // GPIO69 Master CPU Select
#define GPIO_GPCCSEL1_GPIO70_S    24
#define GPIO_GPCCSEL1_GPIO70_M    0xF000000   // GPIO70 Master CPU Select
#define GPIO_GPCCSEL1_GPIO71_S    28
#define GPIO_GPCCSEL1_GPIO71_M    0xF0000000  // GPIO71 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL2 register
//
//*****************************************************************************
#define GPIO_GPCCSEL2_GPIO72_S    0
#define GPIO_GPCCSEL2_GPIO72_M    0xF         // GPIO72 Master CPU Select
#define GPIO_GPCCSEL2_GPIO73_S    4
#define GPIO_GPCCSEL2_GPIO73_M    0xF0        // GPIO73 Master CPU Select
#define GPIO_GPCCSEL2_GPIO74_S    8
#define GPIO_GPCCSEL2_GPIO74_M    0xF00       // GPIO74 Master CPU Select
#define GPIO_GPCCSEL2_GPIO75_S    12
#define GPIO_GPCCSEL2_GPIO75_M    0xF000      // GPIO75 Master CPU Select
#define GPIO_GPCCSEL2_GPIO76_S    16
#define GPIO_GPCCSEL2_GPIO76_M    0xF0000     // GPIO76 Master CPU Select
#define GPIO_GPCCSEL2_GPIO77_S    20
#define GPIO_GPCCSEL2_GPIO77_M    0xF00000    // GPIO77 Master CPU Select
#define GPIO_GPCCSEL2_GPIO78_S    24
#define GPIO_GPCCSEL2_GPIO78_M    0xF000000   // GPIO78 Master CPU Select
#define GPIO_GPCCSEL2_GPIO79_S    28
#define GPIO_GPCCSEL2_GPIO79_M    0xF0000000  // GPIO79 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL3 register
//
//*****************************************************************************
#define GPIO_GPCCSEL3_GPIO80_S    0
#define GPIO_GPCCSEL3_GPIO80_M    0xF         // GPIO80 Master CPU Select
#define GPIO_GPCCSEL3_GPIO81_S    4
#define GPIO_GPCCSEL3_GPIO81_M    0xF0        // GPIO81 Master CPU Select
#define GPIO_GPCCSEL3_GPIO82_S    8
#define GPIO_GPCCSEL3_GPIO82_M    0xF00       // GPIO82 Master CPU Select
#define GPIO_GPCCSEL3_GPIO83_S    12
#define GPIO_GPCCSEL3_GPIO83_M    0xF000      // GPIO83 Master CPU Select
#define GPIO_GPCCSEL3_GPIO84_S    16
#define GPIO_GPCCSEL3_GPIO84_M    0xF0000     // GPIO84 Master CPU Select
#define GPIO_GPCCSEL3_GPIO85_S    20
#define GPIO_GPCCSEL3_GPIO85_M    0xF00000    // GPIO85 Master CPU Select
#define GPIO_GPCCSEL3_GPIO86_S    24
#define GPIO_GPCCSEL3_GPIO86_M    0xF000000   // GPIO86 Master CPU Select
#define GPIO_GPCCSEL3_GPIO87_S    28
#define GPIO_GPCCSEL3_GPIO87_M    0xF0000000  // GPIO87 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL4 register
//
//*****************************************************************************
#define GPIO_GPCCSEL4_GPIO88_S    0
#define GPIO_GPCCSEL4_GPIO88_M    0xF         // GPIO88 Master CPU Select
#define GPIO_GPCCSEL4_GPIO89_S    4
#define GPIO_GPCCSEL4_GPIO89_M    0xF0        // GPIO89 Master CPU Select
#define GPIO_GPCCSEL4_GPIO90_S    8
#define GPIO_GPCCSEL4_GPIO90_M    0xF00       // GPIO90 Master CPU Select
#define GPIO_GPCCSEL4_GPIO91_S    12
#define GPIO_GPCCSEL4_GPIO91_M    0xF000      // GPIO91 Master CPU Select
#define GPIO_GPCCSEL4_GPIO92_S    16
#define GPIO_GPCCSEL4_GPIO92_M    0xF0000     // GPIO92 Master CPU Select
#define GPIO_GPCCSEL4_GPIO93_S    20
#define GPIO_GPCCSEL4_GPIO93_M    0xF00000    // GPIO93 Master CPU Select
#define GPIO_GPCCSEL4_GPIO94_S    24
#define GPIO_GPCCSEL4_GPIO94_M    0xF000000   // GPIO94 Master CPU Select
#define GPIO_GPCCSEL4_GPIO95_S    28
#define GPIO_GPCCSEL4_GPIO95_M    0xF0000000  // GPIO95 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCLOCK register
//
//*****************************************************************************
#define GPIO_GPCLOCK_GPIO64       0x1         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO65       0x2         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO66       0x4         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO67       0x8         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO68       0x10        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO69       0x20        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO70       0x40        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO71       0x80        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO72       0x100       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO73       0x200       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO74       0x400       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO75       0x800       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO76       0x1000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO77       0x2000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO78       0x4000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO79       0x8000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO80       0x10000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO81       0x20000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO82       0x40000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO83       0x80000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO84       0x100000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO85       0x200000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO86       0x400000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO87       0x800000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO88       0x1000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO89       0x2000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO90       0x4000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO91       0x8000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO92       0x10000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO93       0x20000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO94       0x40000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPCLOCK_GPIO95       0x80000000  // Configuration Lock bit for this
                                              // pin

