AdrianoRuseler/LAUNCHXL-F28379D/C2000Ware/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPDPUD register
//
//*****************************************************************************
#define GPIO_GPDPUD_GPIO96        0x1         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO97        0x2         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO98        0x4         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO99        0x8         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO100       0x10        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO101       0x20        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO102       0x40        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO103       0x80        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO104       0x100       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO105       0x200       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO106       0x400       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO107       0x800       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO108       0x1000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO109       0x2000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO110       0x4000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO111       0x8000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO112       0x10000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO113       0x20000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO114       0x40000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO115       0x80000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO116       0x100000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO117       0x200000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO118       0x400000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO119       0x800000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO120       0x1000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO121       0x2000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO122       0x4000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO123       0x8000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO124       0x10000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO125       0x20000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO126       0x40000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPDPUD_GPIO127       0x80000000  // Pull-Up Disable control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDINV register
//
//*****************************************************************************
#define GPIO_GPDINV_GPIO96        0x1         // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO97        0x2         // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO98        0x4         // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO99        0x8         // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO100       0x10        // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO101       0x20        // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO102       0x40        // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO103       0x80        // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO104       0x100       // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO105       0x200       // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO106       0x400       // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO107       0x800       // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO108       0x1000      // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO109       0x2000      // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO110       0x4000      // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO111       0x8000      // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO112       0x10000     // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO113       0x20000     // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO114       0x40000     // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO115       0x80000     // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO116       0x100000    // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO117       0x200000    // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO118       0x400000    // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO119       0x800000    // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO120       0x1000000   // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO121       0x2000000   // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO122       0x4000000   // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO123       0x8000000   // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO124       0x10000000  // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO125       0x20000000  // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO126       0x40000000  // Input inversion control for
                                              // this pin
#define GPIO_GPDINV_GPIO127       0x80000000  // Input inversion control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDODR register
//
//*****************************************************************************
#define GPIO_GPDODR_GPIO96        0x1         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO97        0x2         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO98        0x4         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO99        0x8         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO100       0x10        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO101       0x20        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO102       0x40        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO103       0x80        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO104       0x100       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO105       0x200       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO106       0x400       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO107       0x800       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO108       0x1000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO109       0x2000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO110       0x4000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO111       0x8000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO112       0x10000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO113       0x20000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO114       0x40000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO115       0x80000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO116       0x100000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO117       0x200000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO118       0x400000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO119       0x800000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO120       0x1000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO121       0x2000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO122       0x4000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO123       0x8000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO124       0x10000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO125       0x20000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO126       0x40000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPDODR_GPIO127       0x80000000  // Outpout Open-Drain control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDGMUX1 register
//
//*****************************************************************************
#define GPIO_GPDGMUX1_GPIO96_S    0
#define GPIO_GPDGMUX1_GPIO96_M    0x3         // Defines pin-muxing selection
                                              // for GPIO96
#define GPIO_GPDGMUX1_GPIO97_S    2
#define GPIO_GPDGMUX1_GPIO97_M    0xC         // Defines pin-muxing selection
                                              // for GPIO97
#define GPIO_GPDGMUX1_GPIO98_S    4
#define GPIO_GPDGMUX1_GPIO98_M    0x30        // Defines pin-muxing selection
                                              // for GPIO98
#define GPIO_GPDGMUX1_GPIO99_S    6
#define GPIO_GPDGMUX1_GPIO99_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO99
#define GPIO_GPDGMUX1_GPIO100_S   8
#define GPIO_GPDGMUX1_GPIO100_M   0x300       // Defines pin-muxing selection
                                              // for GPIO100
#define GPIO_GPDGMUX1_GPIO101_S   10
#define GPIO_GPDGMUX1_GPIO101_M   0xC00       // Defines pin-muxing selection
                                              // for GPIO101
#define GPIO_GPDGMUX1_GPIO102_S   12
#define GPIO_GPDGMUX1_GPIO102_M   0x3000      // Defines pin-muxing selection
                                              // for GPIO102
#define GPIO_GPDGMUX1_GPIO103_S   14
#define GPIO_GPDGMUX1_GPIO103_M   0xC000      // Defines pin-muxing selection
                                              // for GPIO103
#define GPIO_GPDGMUX1_GPIO104_S   16
#define GPIO_GPDGMUX1_GPIO104_M   0x30000     // Defines pin-muxing selection
                                              // for GPIO104
#define GPIO_GPDGMUX1_GPIO105_S   18
#define GPIO_GPDGMUX1_GPIO105_M   0xC0000     // Defines pin-muxing selection
                                              // for GPIO105
#define GPIO_GPDGMUX1_GPIO106_S   20
#define GPIO_GPDGMUX1_GPIO106_M   0x300000    // Defines pin-muxing selection
                                              // for GPIO106
#define GPIO_GPDGMUX1_GPIO107_S   22
#define GPIO_GPDGMUX1_GPIO107_M   0xC00000    // Defines pin-muxing selection
                                              // for GPIO107
#define GPIO_GPDGMUX1_GPIO108_S   24
#define GPIO_GPDGMUX1_GPIO108_M   0x3000000   // Defines pin-muxing selection
                                              // for GPIO108
#define GPIO_GPDGMUX1_GPIO109_S   26
#define GPIO_GPDGMUX1_GPIO109_M   0xC000000   // Defines pin-muxing selection
                                              // for GPIO109
#define GPIO_GPDGMUX1_GPIO110_S   28
#define GPIO_GPDGMUX1_GPIO110_M   0x30000000  // Defines pin-muxing selection
                                              // for GPIO110
#define GPIO_GPDGMUX1_GPIO111_S   30
#define GPIO_GPDGMUX1_GPIO111_M   0xC0000000  // Defines pin-muxing selection
                                              // for GPIO111

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDGMUX2 register
//
//*****************************************************************************
#define GPIO_GPDGMUX2_GPIO112_S   0
#define GPIO_GPDGMUX2_GPIO112_M   0x3         // Defines pin-muxing selection
                                              // for GPIO112
#define GPIO_GPDGMUX2_GPIO113_S   2
#define GPIO_GPDGMUX2_GPIO113_M   0xC         // Defines pin-muxing selection
                                              // for GPIO113
#define GPIO_GPDGMUX2_GPIO114_S   4
#define GPIO_GPDGMUX2_GPIO114_M   0x30        // Defines pin-muxing selection
                                              // for GPIO114
#define GPIO_GPDGMUX2_GPIO115_S   6
#define GPIO_GPDGMUX2_GPIO115_M   0xC0        // Defines pin-muxing selection
                                              // for GPIO115
#define GPIO_GPDGMUX2_GPIO116_S   8
#define GPIO_GPDGMUX2_GPIO116_M   0x300       // Defines pin-muxing selection
                                              // for GPIO116
#define GPIO_GPDGMUX2_GPIO117_S   10
#define GPIO_GPDGMUX2_GPIO117_M   0xC00       // Defines pin-muxing selection
                                              // for GPIO117
#define GPIO_GPDGMUX2_GPIO118_S   12
#define GPIO_GPDGMUX2_GPIO118_M   0x3000      // Defines pin-muxing selection
                                              // for GPIO118
#define GPIO_GPDGMUX2_GPIO119_S   14
#define GPIO_GPDGMUX2_GPIO119_M   0xC000      // Defines pin-muxing selection
                                              // for GPIO119
#define GPIO_GPDGMUX2_GPIO120_S   16
#define GPIO_GPDGMUX2_GPIO120_M   0x30000     // Defines pin-muxing selection
                                              // for GPIO120
#define GPIO_GPDGMUX2_GPIO121_S   18
#define GPIO_GPDGMUX2_GPIO121_M   0xC0000     // Defines pin-muxing selection
                                              // for GPIO121
#define GPIO_GPDGMUX2_GPIO122_S   20
#define GPIO_GPDGMUX2_GPIO122_M   0x300000    // Defines pin-muxing selection
                                              // for GPIO122
#define GPIO_GPDGMUX2_GPIO123_S   22
#define GPIO_GPDGMUX2_GPIO123_M   0xC00000    // Defines pin-muxing selection
                                              // for GPIO123
#define GPIO_GPDGMUX2_GPIO124_S   24
#define GPIO_GPDGMUX2_GPIO124_M   0x3000000   // Defines pin-muxing selection
                                              // for GPIO124
#define GPIO_GPDGMUX2_GPIO125_S   26
#define GPIO_GPDGMUX2_GPIO125_M   0xC000000   // Defines pin-muxing selection
                                              // for GPIO125
#define GPIO_GPDGMUX2_GPIO126_S   28
#define GPIO_GPDGMUX2_GPIO126_M   0x30000000  // Defines pin-muxing selection
                                              // for GPIO126
#define GPIO_GPDGMUX2_GPIO127_S   30
#define GPIO_GPDGMUX2_GPIO127_M   0xC0000000  // Defines pin-muxing selection
                                              // for GPIO127

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCSEL1 register
//
//*****************************************************************************
#define GPIO_GPDCSEL1_GPIO96_S    0
#define GPIO_GPDCSEL1_GPIO96_M    0xF         // GPIO96 Master CPU Select
#define GPIO_GPDCSEL1_GPIO97_S    4
#define GPIO_GPDCSEL1_GPIO97_M    0xF0        // GPIO97 Master CPU Select
#define GPIO_GPDCSEL1_GPIO98_S    8
#define GPIO_GPDCSEL1_GPIO98_M    0xF00       // GPIO98 Master CPU Select
#define GPIO_GPDCSEL1_GPIO99_S    12
#define GPIO_GPDCSEL1_GPIO99_M    0xF000      // GPIO99 Master CPU Select
#define GPIO_GPDCSEL1_GPIO100_S   16
#define GPIO_GPDCSEL1_GPIO100_M   0xF0000     // GPIO100 Master CPU Select
#define GPIO_GPDCSEL1_GPIO101_S   20
#define GPIO_GPDCSEL1_GPIO101_M   0xF00000    // GPIO101 Master CPU Select
#define GPIO_GPDCSEL1_GPIO102_S   24
#define GPIO_GPDCSEL1_GPIO102_M   0xF000000   // GPIO102 Master CPU Select
#define GPIO_GPDCSEL1_GPIO103_S   28
#define GPIO_GPDCSEL1_GPIO103_M   0xF0000000  // GPIO103 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCSEL2 register
//
//*****************************************************************************
#define GPIO_GPDCSEL2_GPIO104_S   0
#define GPIO_GPDCSEL2_GPIO104_M   0xF         // GPIO104 Master CPU Select
#define GPIO_GPDCSEL2_GPIO105_S   4
#define GPIO_GPDCSEL2_GPIO105_M   0xF0        // GPIO105 Master CPU Select
#define GPIO_GPDCSEL2_GPIO106_S   8
#define GPIO_GPDCSEL2_GPIO106_M   0xF00       // GPIO106 Master CPU Select
#define GPIO_GPDCSEL2_GPIO107_S   12
#define GPIO_GPDCSEL2_GPIO107_M   0xF000      // GPIO107 Master CPU Select
#define GPIO_GPDCSEL2_GPIO108_S   16
#define GPIO_GPDCSEL2_GPIO108_M   0xF0000     // GPIO108 Master CPU Select
#define GPIO_GPDCSEL2_GPIO109_S   20
#define GPIO_GPDCSEL2_GPIO109_M   0xF00000    // GPIO109 Master CPU Select
#define GPIO_GPDCSEL2_GPIO110_S   24
#define GPIO_GPDCSEL2_GPIO110_M   0xF000000   // GPIO110 Master CPU Select
#define GPIO_GPDCSEL2_GPIO111_S   28
#define GPIO_GPDCSEL2_GPIO111_M   0xF0000000  // GPIO111 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCSEL3 register
//
//*****************************************************************************
#define GPIO_GPDCSEL3_GPIO112_S   0
#define GPIO_GPDCSEL3_GPIO112_M   0xF         // GPIO112 Master CPU Select
#define GPIO_GPDCSEL3_GPIO113_S   4
#define GPIO_GPDCSEL3_GPIO113_M   0xF0        // GPIO113 Master CPU Select
#define GPIO_GPDCSEL3_GPIO114_S   8
#define GPIO_GPDCSEL3_GPIO114_M   0xF00       // GPIO114 Master CPU Select
#define GPIO_GPDCSEL3_GPIO115_S   12
#define GPIO_GPDCSEL3_GPIO115_M   0xF000      // GPIO115 Master CPU Select
#define GPIO_GPDCSEL3_GPIO116_S   16
#define GPIO_GPDCSEL3_GPIO116_M   0xF0000     // GPIO116 Master CPU Select
#define GPIO_GPDCSEL3_GPIO117_S   20
#define GPIO_GPDCSEL3_GPIO117_M   0xF00000    // GPIO117 Master CPU Select
#define GPIO_GPDCSEL3_GPIO118_S   24
#define GPIO_GPDCSEL3_GPIO118_M   0xF000000   // GPIO118 Master CPU Select
#define GPIO_GPDCSEL3_GPIO119_S   28
#define GPIO_GPDCSEL3_GPIO119_M   0xF0000000  // GPIO119 Master CPU Select

